app/controllers/questions_controller.rb

  def index
    @questions = Question.order("created_at ASC")
---
SELECT "questions".* FROM "questions"  ORDER BY created_at ASC

  def show
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @question = Question.new(question_params)
    if @question.save
---
INSERT INTO "questions" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    @question = Question.find(params[:id])
    if @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "questions" SET "description" = $1, "updated_at" = $2 WHERE "questions"."id" = $3

  def destroy
    @question = Question.find(params[:id])
    if @question.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 3]]