app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Danelson"], ["last_name", "Rosa"], ["email", "danelson@rosa.com"], ["created_at", "2015-06-23 18:42:20.443916"], ["updated_at", "2015-06-23 18:42:20.443916"]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "last_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_name", "Rosaaa"], ["updated_at", "2015-06-24 02:58:32.585309"], ["id", 1]]

  def destroy
    @user = User.find(params[:id])
    if @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]